name: "embs_31_L1_coco"
layer {
  name: "data"
  type: "TwoImageData"
  top: "data"
  top: "label"
  image_data_param {
    root_folder: "/opt/home/aharley/datasets/VOC2012"
    source: "segaware/list/voc_val.txt"
    batch_size: 1
    shuffle: false
  }
  two_image_data_param {
    first_is_color: true
    second_is_color: false
  }
  transform_param {
    mean_value: 104.008
    mean_value: 116.669
    mean_value: 122.675
    crop_size: 513
    mirror: false
  }
}
# rgb for emb
layer { 
  bottom: "data"
  name: "rgb_emb"
  top: "rgb_emb"
  type: "Power"
  power_param {
    scale: 0.0039215 # 1/255
  }
}
# Embedding layers
layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 3 pad: 1
    stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 3 pad: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3 pad: 1
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3 pad: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3 pad: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3 pad: 1
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
# resize, for uniformity
layer {
  type: "Interp"
  bottom: "conv2_1"
  name: "conv21_resized"
  top: "conv21_resized"
  interp_param {
    height: 513
    width: 513
  }
}
layer {
  type: "Interp"
  bottom: "conv2_2"
  name: "conv22_resized"
  top: "conv22_resized"
  interp_param {
    height: 513
    width: 513
  }
}
layer {
  type: "Interp"
  bottom: "conv3_1"
  name: "conv31_resized"
  top: "conv31_resized"
  interp_param {
    height: 513
    width: 513
  }
}
# Concat, and weight
layer {
  bottom: "rgb_emb"
  bottom: "conv1_1"
  bottom: "conv1_2"
  bottom: "conv21_resized"
  bottom: "conv22_resized"
  bottom: "conv31_resized"
  top: "fused"
  name: "fused"
  type: "Concat"
}
layer {
  bottom: "fused"
  top: "weighted_avg"
  name: "weighted_avg"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 1 pad: 0
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" }
  }
}
# Add loss to the fused thing
layer { 
  bottom: "label"
  top: "parity"
  name: "parity"
  type: "Im2parity"
  convolution_param {
    kernel_size: 5 pad: 6 dilation: 3
    stride: 1
  }
}
layer {
  bottom: "weighted_avg"
  top: "weighted_avg_dist"
  name: "weighted_avg_dist"
  type: "Im2dist"
  convolution_param {
    kernel_size: 5 pad: 6 dilation: 3
    stride: 1
  }
  im2dist_param {
    norm: L1
  }
}
layer {
  name: "loss_avg"
  type: "DistLoss"
  bottom: "weighted_avg_dist"
  bottom: "parity"
  top: "loss_avg"
  convolution_param {
    kernel_size: 5 pad: 6 dilation: 3
    stride: 1
  }
  dist_loss_param {
    alpha: 5
    beta: 10
    ignore_label: 255
  }
}
layer {
  name: "emb_mat"
  type: "MatWrite"
  bottom: "weighted_avg"
  mat_write_param {
    prefix: "segaware/features/embs_31_L1_coco/voc_val/fc8/"
    source: "segaware/list/voc_val_id.txt"
    strip: 0
    period: 1
  }
}
